Autodesk.Revit.DB.ExternalResourceServerUtils.ServerSupportsIFCLinks(Autodesk.Revit.DB.ExternalResourceReference)
Checks that the server referenced by the given ExternalResourceReference supports
IFC links.
extRef:
The ExternalResourceReference to check.
Returns:
True if the ExternalResourceReference refers to a server that supports IFC links. False otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2018

Autodesk.Revit.DB.ExternalResourceServerUtils.ServerSupportsCADLinks(Autodesk.Revit.DB.ExternalResourceReference)
Checks that the server referenced by the given ExternalResourceReference supports
CAD links.
extRef:
The ExternalResourceReference to check.
Returns:
True if the ExternalResourceReference refers to a server that supports CAD links. False otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2018

Autodesk.Revit.DB.ExternalResourceServerUtils.ServerSupportsRevitLinks(Autodesk.Revit.DB.ExternalResourceReference)
Checks that the server referenced by the given ExternalResourceReference supports
Revit links.
extRef:
The ExternalResourceReference to check.
Returns:
True if the ExternalResourceReference refers to a server that supports Revit links. False otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2015

Autodesk.Revit.DB.ExternalResourceServerUtils.ServerSupportsAssemblyCodeData(Autodesk.Revit.DB.ExternalResourceReference)
Checks that the server referenced by the given ExternalResourceReference supports
AssemblyCodeData.
extRef:
The ExternalResourceReference to check.
Returns:
True if the ExternalResourceReference refers to a server that supports AssemblyCodeData. False otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2015

Autodesk.Revit.DB.ExternalResourceServerUtils.ServerSupportsKeynotes(Autodesk.Revit.DB.ExternalResourceReference)
Checks that the server referenced by the given ExternalResourceReference supports
KeynoteTable data.
extRef:
The ExternalResourceReference to check.
Returns:
True if the ExternalResourceReference refers to a server that supports keynotes.  False otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2015

Autodesk.Revit.DB.ExternalResourceServerUtils.IsValidShortName(System.Guid,System.String)
Checks whether the name is a valid short name for the external resource server.
Remarks:
A valid short name should match the restrictions documented in Autodesk.Revit.DB.IExternalResourceServer.GetShortName.
serverId:
The id of the external resource server.
serverName:
The short name of the external resource server.
Returns:
True if the name is a valid short name, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2015

Autodesk.Revit.DB.ExternalResourceServerUtils
Contains utilities related to external resource server.
Since:
2015